SoapAPI/src/test/resources/getBook.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.soap.it.p.lodz.pl/">
    <soapenv:Header/>
    <soapenv:Body>
        <api:getSingleBookFromStorage>
            <!--Optional:-->
            <arg0>testArg0</arg0>
        </api:getSingleBookFromStorage>
    </soapenv:Body>
</soapenv:Envelope>